#+TITLE: Quantitative Methods
#+PROPERTY: header-args:R :session acj :eval never-export
#+STARTUP: hideall inlineimages hideblocks
#+SETUPFILE: https://fniessen.github.io/org-html-themes/setup/theme-readtheorg.setup
#+HTML_HEAD: <style>#content{max-width:1200px;} </style>

*** Frequency                                      :slide:

#+NAME: worker-code0
#+begin_src R :results value :export results :colnames yes :hline
      library(data.table)
      data.table(names=c("Anil","Neeraj","Savita","Srimati",
                         "Rekha","Pooja","Alex","Shahina",
                         "Ghazal","Lakshmi","Rahul","Shahrukh",
                         "Naman","Deepak","Shreya","Rukhsana"
                         ),
                 salary=c(71,50,65,40,
                          45,42,46,43,
                          45,43,45,45,
                          850,100,46,48
                          )*1000,
                 sex=c("M","M","F","F",
                       "F","F","M","F",
                       "F","F","M","M",
                       "M","M","F","F"
                       ))->workers
      workers$sno<-c(1:nrow(workers))
      workers[,.(sno,names,sex,salary)]
#+end_src

#+RESULTS: worker-code0
| sno | names    | sex | salary |
|-----+----------+-----+--------|
|   1 | Anil     | M   |  71000 |
|   2 | Neeraj   | M   |  50000 |
|   3 | Savita   | F   |  65000 |
|   4 | Srimati  | F   |  40000 |
|   5 | Rekha    | F   |  45000 |
|   6 | Pooja    | F   |  42000 |
|   7 | Alex     | M   |  46000 |
|   8 | Shahina  | F   |  43000 |
|   9 | Ghazal   | F   |  45000 |
|  10 | Lakshmi  | F   |  43000 |
|  11 | Rahul    | M   |  45000 |
|  12 | Shahrukh | M   |  45000 |
|  13 | Naman    | M   | 850000 |
|  14 | Deepak   | M   |  1e+05 |
|  15 | Shreya   | F   |  46000 |
|  16 | Rukhsana | F   |  48000 |

#+NAME: freq-code

#+begin_src R :results value :export results :colnames yes :hline
  workers[,.(frequency=length(sno)),.(sex)]
#+end_src

#+RESULTS:
| sex | frequency |
|-----+-----------|
| M   |         7 |
| F   |         9 |

#+RESULTS: freq-code
| sex | frequency |
|-----+-----------|
| M   |         7 |
| F   |         9 |

*** Measures of Central Tendency                   :slide:

#+NAME: mid-code
#+begin_src R :results value :export results :colnames yes :hline
  workers[,.(mean_salary=round(mean(salary),1),
              median_salary=quantile(salary,prob=0.5))]
#+End_src

#+RESULTS: mid-code
| mean_salary | median_salary |
|-------------+---------------|
|      101500 |         45500 |

#+NAME: mid2-code
#+begin_src R :results value :export results :colnames yes :hline
  workers[,.(mean_salary=round(mean(salary),1),
             median_salary=quantile(salary,prob=0.5)),.(sex)]
#+end_src

#+RESULTS: mid2-code
| sex | mean_salary | median_salary |
|-----+-------------+---------------|
| M   |    172428.6 |         50000 |
| F   |     46333.3 |         45000 |

**** Variance, Standard Deviation and Coefficient of Variation

$variance=\frac{1}{n} \times \sum(x_{i}-x)^{2}$

$standard.deviation = \sqrt{variance}$

$cov=\frac{standard.deviation}{mean}$

#+NAME: var-code
#+begin_src R :results value :export results :colnames yes :hline
  workers[,.(var_salary=round(var(salary),1),
             sd_salary=round(sqrt(var(salary)),1),
             cov_salary=round(sqrt(var(salary))/mean(salary),2))
          ]
#+end_src

#+RESULTS: var-code
|  var_salary | sd_salary | cov_salary |
|-------------+-----------+------------|
| 40075200000 |  200187.9 |       1.97 |

#+NAME: var2-code
#+begin_src R :results value :export results :colnames yes :hline
    students[,.(var_salary=round(var(salary),1),
                sd_salary=round(sqrt(var(salary)),1),
                cov_salary=round(sqrt(var(salary))/mean(salary),2)),.(sex)]
#+end_src

#+RESULTS: var2-code
| sex |  var_salary | sd_salary | cov_salary |
|-----+-------------+-----------+------------|
| M   | 89680952381 |  299467.8 |       1.74 |
| F   |    54500000 |    7382.4 |       0.16 |


